// modified from `bindgen --allowlist-item 'sv.*' --rust-target 1.85 --rust-edition 2024 --merge-extern-blocks --default-macro-constant-type signed svdpi.h`
#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]


/* automatically generated by rust-bindgen 0.71.1 */

pub const sv_0: i32 = 0;
pub const sv_1: i32 = 1;
pub const sv_z: i32 = 2;
pub const sv_x: i32 = 3;
pub const sv_scaled_real_time: i32 = 1;
pub const sv_sim_time: i32 = 2;
pub type svScalar = u8;
pub type svBit = svScalar;
pub type svLogic = svScalar;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct t_vpi_vecval {
    pub aval: u32,
    pub bval: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_vpi_vecval"][::std::mem::size_of::<t_vpi_vecval>() - 8usize];
    ["Alignment of t_vpi_vecval"][::std::mem::align_of::<t_vpi_vecval>() - 4usize];
    ["Offset of field: t_vpi_vecval::aval"][::std::mem::offset_of!(t_vpi_vecval, aval) - 0usize];
    ["Offset of field: t_vpi_vecval::bval"][::std::mem::offset_of!(t_vpi_vecval, bval) - 4usize];
};
pub type s_vpi_vecval = t_vpi_vecval;
pub type svLogicVecVal = s_vpi_vecval;
pub type svBitVecVal = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct t_vpi_time {
    pub type_: i32,
    pub high: u32,
    pub low: u32,
    pub real: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_vpi_time"][::std::mem::size_of::<t_vpi_time>() - 24usize];
    ["Alignment of t_vpi_time"][::std::mem::align_of::<t_vpi_time>() - 8usize];
    ["Offset of field: t_vpi_time::type_"][::std::mem::offset_of!(t_vpi_time, type_) - 0usize];
    ["Offset of field: t_vpi_time::high"][::std::mem::offset_of!(t_vpi_time, high) - 4usize];
    ["Offset of field: t_vpi_time::low"][::std::mem::offset_of!(t_vpi_time, low) - 8usize];
    ["Offset of field: t_vpi_time::real"][::std::mem::offset_of!(t_vpi_time, real) - 16usize];
};
pub type s_vpi_time = t_vpi_time;
pub type svTimeVal = s_vpi_time;
pub type svScope = *mut ::std::os::raw::c_void;
pub type svOpenArrayHandle = *mut ::std::os::raw::c_void;
pub type svBitVec32 = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct svLogicVec32 {
    pub c: ::std::os::raw::c_uint,
    pub d: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of svLogicVec32"][::std::mem::size_of::<svLogicVec32>() - 8usize];
    ["Alignment of svLogicVec32"][::std::mem::align_of::<svLogicVec32>() - 4usize];
    ["Offset of field: svLogicVec32::c"][::std::mem::offset_of!(svLogicVec32, c) - 0usize];
    ["Offset of field: svLogicVec32::d"][::std::mem::offset_of!(svLogicVec32, d) - 4usize];
};
pub type svBitPackedArrRef = *mut ::std::os::raw::c_void;
pub type svLogicPackedArrRef = *mut ::std::os::raw::c_void;
unsafe extern "C" {
    pub fn svDpiVersion() -> *const ::std::os::raw::c_char;
    pub fn svGetBitselBit(s: *const svBitVecVal, i: ::std::os::raw::c_int) -> svBit;
    pub fn svGetBitselLogic(s: *const svLogicVecVal, i: ::std::os::raw::c_int) -> svLogic;
    pub fn svPutBitselBit(d: *mut svBitVecVal, i: ::std::os::raw::c_int, s: svBit);
    pub fn svPutBitselLogic(d: *mut svLogicVecVal, i: ::std::os::raw::c_int, s: svLogic);
    pub fn svGetPartselBit(
        d: *mut svBitVecVal,
        s: *const svBitVecVal,
        i: ::std::os::raw::c_int,
        w: ::std::os::raw::c_int,
    );
    pub fn svGetPartselLogic(
        d: *mut svLogicVecVal,
        s: *const svLogicVecVal,
        i: ::std::os::raw::c_int,
        w: ::std::os::raw::c_int,
    );
    pub fn svPutPartselBit(
        d: *mut svBitVecVal,
        s: svBitVecVal,
        i: ::std::os::raw::c_int,
        w: ::std::os::raw::c_int,
    );
    pub fn svPutPartselLogic(
        d: *mut svLogicVecVal,
        s: svLogicVecVal,
        i: ::std::os::raw::c_int,
        w: ::std::os::raw::c_int,
    );
    pub fn svLeft(h: svOpenArrayHandle, d: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    pub fn svRight(h: svOpenArrayHandle, d: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    pub fn svLow(h: svOpenArrayHandle, d: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    pub fn svHigh(h: svOpenArrayHandle, d: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    pub fn svIncrement(h: svOpenArrayHandle, d: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    pub fn svSize(h: svOpenArrayHandle, d: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    pub fn svDimensions(h: svOpenArrayHandle) -> ::std::os::raw::c_int;
    pub fn svGetArrayPtr(arg1: svOpenArrayHandle) -> *mut ::std::os::raw::c_void;
    pub fn svSizeOfArray(arg1: svOpenArrayHandle) -> ::std::os::raw::c_int;
    pub fn svGetArrElemPtr(
        arg1: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        ...
    ) -> *mut ::std::os::raw::c_void;
    pub fn svGetArrElemPtr1(
        arg1: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
    pub fn svGetArrElemPtr2(
        arg1: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
    pub fn svGetArrElemPtr3(
        arg1: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
        indx3: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
    pub fn svPutBitArrElemVecVal(
        d: svOpenArrayHandle,
        s: *const svBitVecVal,
        indx1: ::std::os::raw::c_int,
        ...
    );
    pub fn svPutBitArrElem1VecVal(
        d: svOpenArrayHandle,
        s: *const svBitVecVal,
        indx1: ::std::os::raw::c_int,
    );
    pub fn svPutBitArrElem2VecVal(
        d: svOpenArrayHandle,
        s: *const svBitVecVal,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
    );
    pub fn svPutBitArrElem3VecVal(
        d: svOpenArrayHandle,
        s: *const svBitVecVal,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
        indx3: ::std::os::raw::c_int,
    );
    pub fn svPutLogicArrElemVecVal(
        d: svOpenArrayHandle,
        s: *const svLogicVecVal,
        indx1: ::std::os::raw::c_int,
        ...
    );
    pub fn svPutLogicArrElem1VecVal(
        d: svOpenArrayHandle,
        s: *const svLogicVecVal,
        indx1: ::std::os::raw::c_int,
    );
    pub fn svPutLogicArrElem2VecVal(
        d: svOpenArrayHandle,
        s: *const svLogicVecVal,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
    );
    pub fn svPutLogicArrElem3VecVal(
        d: svOpenArrayHandle,
        s: *const svLogicVecVal,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
        indx3: ::std::os::raw::c_int,
    );
    pub fn svGetBitArrElemVecVal(
        d: *mut svBitVecVal,
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        ...
    );
    pub fn svGetBitArrElem1VecVal(
        d: *mut svBitVecVal,
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
    );
    pub fn svGetBitArrElem2VecVal(
        d: *mut svBitVecVal,
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
    );
    pub fn svGetBitArrElem3VecVal(
        d: *mut svBitVecVal,
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
        indx3: ::std::os::raw::c_int,
    );
    pub fn svGetLogicArrElemVecVal(
        d: *mut svLogicVecVal,
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        ...
    );
    pub fn svGetLogicArrElem1VecVal(
        d: *mut svLogicVecVal,
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
    );
    pub fn svGetLogicArrElem2VecVal(
        d: *mut svLogicVecVal,
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
    );
    pub fn svGetLogicArrElem3VecVal(
        d: *mut svLogicVecVal,
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
        indx3: ::std::os::raw::c_int,
    );
    pub fn svGetBitArrElem(s: svOpenArrayHandle, indx1: ::std::os::raw::c_int, ...) -> svBit;
    pub fn svGetBitArrElem1(s: svOpenArrayHandle, indx1: ::std::os::raw::c_int) -> svBit;
    pub fn svGetBitArrElem2(
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
    ) -> svBit;
    pub fn svGetBitArrElem3(
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
        indx3: ::std::os::raw::c_int,
    ) -> svBit;
    pub fn svGetLogicArrElem(s: svOpenArrayHandle, indx1: ::std::os::raw::c_int, ...) -> svLogic;
    pub fn svGetLogicArrElem1(s: svOpenArrayHandle, indx1: ::std::os::raw::c_int) -> svLogic;
    pub fn svGetLogicArrElem2(
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
    ) -> svLogic;
    pub fn svGetLogicArrElem3(
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
        indx3: ::std::os::raw::c_int,
    ) -> svLogic;
    pub fn svPutLogicArrElem(
        d: svOpenArrayHandle,
        value: svLogic,
        indx1: ::std::os::raw::c_int,
        ...
    );
    pub fn svPutLogicArrElem1(d: svOpenArrayHandle, value: svLogic, indx1: ::std::os::raw::c_int);
    pub fn svPutLogicArrElem2(
        d: svOpenArrayHandle,
        value: svLogic,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
    );
    pub fn svPutLogicArrElem3(
        d: svOpenArrayHandle,
        value: svLogic,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
        indx3: ::std::os::raw::c_int,
    );
    pub fn svPutBitArrElem(d: svOpenArrayHandle, value: svBit, indx1: ::std::os::raw::c_int, ...);
    pub fn svPutBitArrElem1(d: svOpenArrayHandle, value: svBit, indx1: ::std::os::raw::c_int);
    pub fn svPutBitArrElem2(
        d: svOpenArrayHandle,
        value: svBit,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
    );
    pub fn svPutBitArrElem3(
        d: svOpenArrayHandle,
        value: svBit,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
        indx3: ::std::os::raw::c_int,
    );
    pub fn svGetScope() -> svScope;
    pub fn svSetScope(scope: svScope) -> svScope;
    pub fn svGetNameFromScope(arg1: svScope) -> *const ::std::os::raw::c_char;
    pub fn svGetScopeFromName(scopeName: *const ::std::os::raw::c_char) -> svScope;
    pub fn svPutUserData(
        scope: svScope,
        userKey: *mut ::std::os::raw::c_void,
        userData: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
    pub fn svGetUserData(
        scope: svScope,
        userKey: *mut ::std::os::raw::c_void,
    ) -> *mut ::std::os::raw::c_void;
    pub fn svGetCallerInfo(
        fileName: *mut *const ::std::os::raw::c_char,
        lineNumber: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
    pub fn svIsDisabledState() -> ::std::os::raw::c_int;
    pub fn svAckDisabledState();
    #[cfg(feature = "sv2023")]
    pub fn svGetTime(scope: svScope, time: *mut svTimeVal) -> ::std::os::raw::c_int;
    #[cfg(feature = "sv2023")]
    pub fn svGetTimeUnit(scope: svScope, time_unit: *mut i32) -> ::std::os::raw::c_int;
    #[cfg(feature = "sv2023")]
    pub fn svGetTimePrecision(scope: svScope, time_precision: *mut i32) -> ::std::os::raw::c_int;
    pub fn svSizeOfBitPackedArr(width: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    pub fn svSizeOfLogicPackedArr(width: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    pub fn svPutBitVec32(d: svBitPackedArrRef, s: *const svBitVec32, w: ::std::os::raw::c_int);
    pub fn svPutLogicVec32(
        d: svLogicPackedArrRef,
        s: *const svLogicVec32,
        w: ::std::os::raw::c_int,
    );
    pub fn svGetBitVec32(d: *mut svBitVec32, s: svBitPackedArrRef, w: ::std::os::raw::c_int);
    pub fn svGetLogicVec32(d: *mut svLogicVec32, s: svLogicPackedArrRef, w: ::std::os::raw::c_int);
    pub fn svGetSelectBit(s: svBitPackedArrRef, i: ::std::os::raw::c_int) -> svBit;
    pub fn svGetSelectLogic(s: svLogicPackedArrRef, i: ::std::os::raw::c_int) -> svLogic;
    pub fn svPutSelectBit(d: svBitPackedArrRef, i: ::std::os::raw::c_int, s: svBit);
    pub fn svPutSelectLogic(d: svLogicPackedArrRef, i: ::std::os::raw::c_int, s: svLogic);
    pub fn svGetPartSelectBit(
        d: *mut svBitVec32,
        s: svBitPackedArrRef,
        i: ::std::os::raw::c_int,
        w: ::std::os::raw::c_int,
    );
    pub fn svGetBits(
        s: svBitPackedArrRef,
        i: ::std::os::raw::c_int,
        w: ::std::os::raw::c_int,
    ) -> svBitVec32;
    pub fn svGet32Bits(s: svBitPackedArrRef, i: ::std::os::raw::c_int) -> svBitVec32;
    pub fn svGet64Bits(s: svBitPackedArrRef, i: ::std::os::raw::c_int) -> u64;
    pub fn svGetPartSelectLogic(
        d: *mut svLogicVec32,
        s: svLogicPackedArrRef,
        i: ::std::os::raw::c_int,
        w: ::std::os::raw::c_int,
    );
    pub fn svPutPartSelectBit(
        d: svBitPackedArrRef,
        s: svBitVec32,
        i: ::std::os::raw::c_int,
        w: ::std::os::raw::c_int,
    );
    pub fn svPutPartSelectLogic(
        d: svLogicPackedArrRef,
        s: *const svLogicVec32,
        i: ::std::os::raw::c_int,
        w: ::std::os::raw::c_int,
    );
    pub fn svPutBitArrElemVec32(
        d: svOpenArrayHandle,
        s: *const svBitVec32,
        indx1: ::std::os::raw::c_int,
        ...
    );
    pub fn svPutBitArrElem1Vec32(
        d: svOpenArrayHandle,
        s: *const svBitVec32,
        indx1: ::std::os::raw::c_int,
    );
    pub fn svPutBitArrElem2Vec32(
        d: svOpenArrayHandle,
        s: *const svBitVec32,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
    );
    pub fn svPutBitArrElem3Vec32(
        d: svOpenArrayHandle,
        s: *const svBitVec32,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
        indx3: ::std::os::raw::c_int,
    );
    pub fn svPutLogicArrElemVec32(
        d: svOpenArrayHandle,
        s: *const svLogicVec32,
        indx1: ::std::os::raw::c_int,
        ...
    );
    pub fn svPutLogicArrElem1Vec32(
        d: svOpenArrayHandle,
        s: *const svLogicVec32,
        indx1: ::std::os::raw::c_int,
    );
    pub fn svPutLogicArrElem2Vec32(
        d: svOpenArrayHandle,
        s: *const svLogicVec32,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
    );
    pub fn svPutLogicArrElem3Vec32(
        d: svOpenArrayHandle,
        s: *const svLogicVec32,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
        indx3: ::std::os::raw::c_int,
    );
    pub fn svGetBitArrElemVec32(
        d: *mut svBitVec32,
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        ...
    );
    pub fn svGetBitArrElem1Vec32(
        d: *mut svBitVec32,
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
    );
    pub fn svGetBitArrElem2Vec32(
        d: *mut svBitVec32,
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
    );
    pub fn svGetBitArrElem3Vec32(
        d: *mut svBitVec32,
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
        indx3: ::std::os::raw::c_int,
    );
    pub fn svGetLogicArrElemVec32(
        d: *mut svLogicVec32,
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        ...
    );
    pub fn svGetLogicArrElem1Vec32(
        d: *mut svLogicVec32,
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
    );
    pub fn svGetLogicArrElem2Vec32(
        d: *mut svLogicVec32,
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
    );
    pub fn svGetLogicArrElem3Vec32(
        d: *mut svLogicVec32,
        s: svOpenArrayHandle,
        indx1: ::std::os::raw::c_int,
        indx2: ::std::os::raw::c_int,
        indx3: ::std::os::raw::c_int,
    );
}
