// modified from `bindgen --allowlist-item 'vpi.*' --rust-target 1.85 --rust-edition 2024 --merge-extern-blocks --default-macro-constant-type signed sv_vpi_user.h`
#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]

/* automatically generated by rust-bindgen 0.71.1 */

pub const vpiAlways: i32 = 1;
pub const vpiAssignStmt: i32 = 2;
pub const vpiAssignment: i32 = 3;
pub const vpiBegin: i32 = 4;
pub const vpiCase: i32 = 5;
pub const vpiCaseItem: i32 = 6;
pub const vpiConstant: i32 = 7;
pub const vpiContAssign: i32 = 8;
pub const vpiDeassign: i32 = 9;
pub const vpiDefParam: i32 = 10;
pub const vpiDelayControl: i32 = 11;
pub const vpiDisable: i32 = 12;
pub const vpiEventControl: i32 = 13;
pub const vpiEventStmt: i32 = 14;
pub const vpiFor: i32 = 15;
pub const vpiForce: i32 = 16;
pub const vpiForever: i32 = 17;
pub const vpiFork: i32 = 18;
pub const vpiFuncCall: i32 = 19;
pub const vpiFunction: i32 = 20;
pub const vpiGate: i32 = 21;
pub const vpiIf: i32 = 22;
pub const vpiIfElse: i32 = 23;
pub const vpiInitial: i32 = 24;
pub const vpiIntegerVar: i32 = 25;
pub const vpiInterModPath: i32 = 26;
pub const vpiIterator: i32 = 27;
pub const vpiIODecl: i32 = 28;
pub const vpiMemory: i32 = 29;
pub const vpiMemoryWord: i32 = 30;
pub const vpiModPath: i32 = 31;
pub const vpiModule: i32 = 32;
pub const vpiNamedBegin: i32 = 33;
pub const vpiNamedEvent: i32 = 34;
pub const vpiNamedFork: i32 = 35;
pub const vpiNet: i32 = 36;

pub const vpiInsideOp: i32 = 95;
pub const vpiTypeOp: i32 = 81;
pub const vpiAssignmentOp: i32 = 82;
pub const vpiOtherFunc: i32 = 6;
pub const vpiValidUnknown: i32 = 2;
pub const vpiCoverageStart: i32 = 750;
pub const vpiCoverageStop: i32 = 751;
pub const vpiCoverageReset: i32 = 752;
pub const vpiCoverageCheck: i32 = 753;
pub const vpiCoverageMerge: i32 = 754;
pub const vpiCoverageSave: i32 = 755;
pub const vpiAssertCoverage: i32 = 760;
pub const vpiFsmStateCoverage: i32 = 761;
pub const vpiStatementCoverage: i32 = 762;
pub const vpiToggleCoverage: i32 = 763;
pub const vpiCovered: i32 = 765;
pub const vpiCoverMax: i32 = 766;
pub const vpiCoveredMax: i32 = 766;
pub const vpiCoveredCount: i32 = 767;
pub const vpiAssertAttemptCovered: i32 = 770;
pub const vpiAssertSuccessCovered: i32 = 771;
pub const vpiAssertFailureCovered: i32 = 772;
pub const vpiAssertVacuousSuccessCovered: i32 = 773;
pub const vpiAssertDisableCovered: i32 = 774;
pub const vpiAssertKillCovered: i32 = 777;
pub const vpiFsmStates: i32 = 775;
pub const vpiFsmStateExpression: i32 = 776;
pub const vpiFsm: i32 = 758;
pub const vpiFsmHandle: i32 = 759;
pub const vpiAssertionLock: i32 = 645;
pub const vpiAssertionUnlock: i32 = 646;
pub const vpiAssertionDisable: i32 = 620;
pub const vpiAssertionEnable: i32 = 621;
pub const vpiAssertionReset: i32 = 622;
pub const vpiAssertionKill: i32 = 623;
pub const vpiAssertionEnableStep: i32 = 624;
pub const vpiAssertionDisableStep: i32 = 625;
pub const vpiAssertionClockSteps: i32 = 626;
pub const vpiAssertionSysLock: i32 = 647;
pub const vpiAssertionSysUnlock: i32 = 648;
pub const vpiAssertionSysOn: i32 = 627;
pub const vpiAssertionSysOff: i32 = 628;
pub const vpiAssertionSysKill: i32 = 632;
pub const vpiAssertionSysEnd: i32 = 629;
pub const vpiAssertionSysReset: i32 = 630;
pub const vpiAssertionDisablePassAction: i32 = 633;
pub const vpiAssertionEnablePassAction: i32 = 634;
pub const vpiAssertionDisableFailAction: i32 = 635;
pub const vpiAssertionEnableFailAction: i32 = 636;
pub const vpiAssertionDisableVacuousAction: i32 = 637;
pub const vpiAssertionEnableNonvacuousAction: i32 = 638;
pub const vpiAssertionSysEnablePassAction: i32 = 639;
pub const vpiAssertionSysEnableFailAction: i32 = 640;
pub const vpiAssertionSysDisablePassAction: i32 = 641;
pub const vpiAssertionSysDisableFailAction: i32 = 642;
pub const vpiAssertionSysEnableNonvacuousAction: i32 = 643;
pub const vpiAssertionSysDisableVacuousAction: i32 = 644;
pub type va_list = __builtin_va_list;
pub type PLI_INT64 = i64;
pub type PLI_INT32 = ::std::os::raw::c_int;
pub type PLI_UINT32 = ::std::os::raw::c_uint;
pub type PLI_INT16 = ::std::os::raw::c_short;
pub type PLI_BYTE8 = ::std::os::raw::c_char;
#[doc = " TYPEDEFS"]
pub type vpiHandle = *mut PLI_UINT32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct t_vpi_time {
    pub type_: PLI_INT32,
    pub high: PLI_UINT32,
    pub low: PLI_UINT32,
    pub real: f64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_vpi_time"][::std::mem::size_of::<t_vpi_time>() - 24usize];
    ["Alignment of t_vpi_time"][::std::mem::align_of::<t_vpi_time>() - 8usize];
    ["Offset of field: t_vpi_time::type_"][::std::mem::offset_of!(t_vpi_time, type_) - 0usize];
    ["Offset of field: t_vpi_time::high"][::std::mem::offset_of!(t_vpi_time, high) - 4usize];
    ["Offset of field: t_vpi_time::low"][::std::mem::offset_of!(t_vpi_time, low) - 8usize];
    ["Offset of field: t_vpi_time::real"][::std::mem::offset_of!(t_vpi_time, real) - 16usize];
};
pub type s_vpi_time = t_vpi_time;
pub type p_vpi_time = *mut t_vpi_time;
#[doc = " delay structures"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct t_vpi_delay {
    pub da: *mut t_vpi_time,
    pub no_of_delays: PLI_INT32,
    pub time_type: PLI_INT32,
    pub mtm_flag: PLI_INT32,
    pub append_flag: PLI_INT32,
    pub pulsere_flag: PLI_INT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_vpi_delay"][::std::mem::size_of::<t_vpi_delay>() - 32usize];
    ["Alignment of t_vpi_delay"][::std::mem::align_of::<t_vpi_delay>() - 8usize];
    ["Offset of field: t_vpi_delay::da"][::std::mem::offset_of!(t_vpi_delay, da) - 0usize];
    ["Offset of field: t_vpi_delay::no_of_delays"]
        [::std::mem::offset_of!(t_vpi_delay, no_of_delays) - 8usize];
    ["Offset of field: t_vpi_delay::time_type"]
        [::std::mem::offset_of!(t_vpi_delay, time_type) - 12usize];
    ["Offset of field: t_vpi_delay::mtm_flag"]
        [::std::mem::offset_of!(t_vpi_delay, mtm_flag) - 16usize];
    ["Offset of field: t_vpi_delay::append_flag"]
        [::std::mem::offset_of!(t_vpi_delay, append_flag) - 20usize];
    ["Offset of field: t_vpi_delay::pulsere_flag"]
        [::std::mem::offset_of!(t_vpi_delay, pulsere_flag) - 24usize];
};
#[doc = " delay structures"]
pub type p_vpi_delay = *mut t_vpi_delay;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct t_vpi_vecval {
    pub aval: PLI_UINT32,
    pub bval: PLI_UINT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_vpi_vecval"][::std::mem::size_of::<t_vpi_vecval>() - 8usize];
    ["Alignment of t_vpi_vecval"][::std::mem::align_of::<t_vpi_vecval>() - 4usize];
    ["Offset of field: t_vpi_vecval::aval"][::std::mem::offset_of!(t_vpi_vecval, aval) - 0usize];
    ["Offset of field: t_vpi_vecval::bval"][::std::mem::offset_of!(t_vpi_vecval, bval) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct t_vpi_strengthval {
    pub logic: PLI_INT32,
    pub s0: PLI_INT32,
    pub s1: PLI_INT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_vpi_strengthval"][::std::mem::size_of::<t_vpi_strengthval>() - 12usize];
    ["Alignment of t_vpi_strengthval"][::std::mem::align_of::<t_vpi_strengthval>() - 4usize];
    ["Offset of field: t_vpi_strengthval::logic"]
        [::std::mem::offset_of!(t_vpi_strengthval, logic) - 0usize];
    ["Offset of field: t_vpi_strengthval::s0"]
        [::std::mem::offset_of!(t_vpi_strengthval, s0) - 4usize];
    ["Offset of field: t_vpi_strengthval::s1"]
        [::std::mem::offset_of!(t_vpi_strengthval, s1) - 8usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct t_vpi_value {
    pub format: PLI_INT32,
    pub value: t_vpi_value__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union t_vpi_value__bindgen_ty_1 {
    pub str_: *mut PLI_BYTE8,
    pub scalar: PLI_INT32,
    pub integer: PLI_INT32,
    pub real: f64,
    pub time: *mut t_vpi_time,
    pub vector: *mut t_vpi_vecval,
    pub strength: *mut t_vpi_strengthval,
    pub misc: *mut PLI_BYTE8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_vpi_value__bindgen_ty_1"]
        [::std::mem::size_of::<t_vpi_value__bindgen_ty_1>() - 8usize];
    ["Alignment of t_vpi_value__bindgen_ty_1"]
        [::std::mem::align_of::<t_vpi_value__bindgen_ty_1>() - 8usize];
    ["Offset of field: t_vpi_value__bindgen_ty_1::str_"]
        [::std::mem::offset_of!(t_vpi_value__bindgen_ty_1, str_) - 0usize];
    ["Offset of field: t_vpi_value__bindgen_ty_1::scalar"]
        [::std::mem::offset_of!(t_vpi_value__bindgen_ty_1, scalar) - 0usize];
    ["Offset of field: t_vpi_value__bindgen_ty_1::integer"]
        [::std::mem::offset_of!(t_vpi_value__bindgen_ty_1, integer) - 0usize];
    ["Offset of field: t_vpi_value__bindgen_ty_1::real"]
        [::std::mem::offset_of!(t_vpi_value__bindgen_ty_1, real) - 0usize];
    ["Offset of field: t_vpi_value__bindgen_ty_1::time"]
        [::std::mem::offset_of!(t_vpi_value__bindgen_ty_1, time) - 0usize];
    ["Offset of field: t_vpi_value__bindgen_ty_1::vector"]
        [::std::mem::offset_of!(t_vpi_value__bindgen_ty_1, vector) - 0usize];
    ["Offset of field: t_vpi_value__bindgen_ty_1::strength"]
        [::std::mem::offset_of!(t_vpi_value__bindgen_ty_1, strength) - 0usize];
    ["Offset of field: t_vpi_value__bindgen_ty_1::misc"]
        [::std::mem::offset_of!(t_vpi_value__bindgen_ty_1, misc) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_vpi_value"][::std::mem::size_of::<t_vpi_value>() - 16usize];
    ["Alignment of t_vpi_value"][::std::mem::align_of::<t_vpi_value>() - 8usize];
    ["Offset of field: t_vpi_value::format"][::std::mem::offset_of!(t_vpi_value, format) - 0usize];
    ["Offset of field: t_vpi_value::value"][::std::mem::offset_of!(t_vpi_value, value) - 8usize];
};
pub type p_vpi_value = *mut t_vpi_value;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct t_vpi_arrayvalue {
    pub format: PLI_UINT32,
    pub flags: PLI_UINT32,
    pub value: t_vpi_arrayvalue__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union t_vpi_arrayvalue__bindgen_ty_1 {
    pub integers: *mut PLI_INT32,
    pub shortints: *mut PLI_INT16,
    pub longints: *mut PLI_INT64,
    pub rawvals: *mut PLI_BYTE8,
    pub vectors: *mut t_vpi_vecval,
    pub times: *mut t_vpi_time,
    pub reals: *mut f64,
    pub shortreals: *mut f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_vpi_arrayvalue__bindgen_ty_1"]
        [::std::mem::size_of::<t_vpi_arrayvalue__bindgen_ty_1>() - 8usize];
    ["Alignment of t_vpi_arrayvalue__bindgen_ty_1"]
        [::std::mem::align_of::<t_vpi_arrayvalue__bindgen_ty_1>() - 8usize];
    ["Offset of field: t_vpi_arrayvalue__bindgen_ty_1::integers"]
        [::std::mem::offset_of!(t_vpi_arrayvalue__bindgen_ty_1, integers) - 0usize];
    ["Offset of field: t_vpi_arrayvalue__bindgen_ty_1::shortints"]
        [::std::mem::offset_of!(t_vpi_arrayvalue__bindgen_ty_1, shortints) - 0usize];
    ["Offset of field: t_vpi_arrayvalue__bindgen_ty_1::longints"]
        [::std::mem::offset_of!(t_vpi_arrayvalue__bindgen_ty_1, longints) - 0usize];
    ["Offset of field: t_vpi_arrayvalue__bindgen_ty_1::rawvals"]
        [::std::mem::offset_of!(t_vpi_arrayvalue__bindgen_ty_1, rawvals) - 0usize];
    ["Offset of field: t_vpi_arrayvalue__bindgen_ty_1::vectors"]
        [::std::mem::offset_of!(t_vpi_arrayvalue__bindgen_ty_1, vectors) - 0usize];
    ["Offset of field: t_vpi_arrayvalue__bindgen_ty_1::times"]
        [::std::mem::offset_of!(t_vpi_arrayvalue__bindgen_ty_1, times) - 0usize];
    ["Offset of field: t_vpi_arrayvalue__bindgen_ty_1::reals"]
        [::std::mem::offset_of!(t_vpi_arrayvalue__bindgen_ty_1, reals) - 0usize];
    ["Offset of field: t_vpi_arrayvalue__bindgen_ty_1::shortreals"]
        [::std::mem::offset_of!(t_vpi_arrayvalue__bindgen_ty_1, shortreals) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_vpi_arrayvalue"][::std::mem::size_of::<t_vpi_arrayvalue>() - 16usize];
    ["Alignment of t_vpi_arrayvalue"][::std::mem::align_of::<t_vpi_arrayvalue>() - 8usize];
    ["Offset of field: t_vpi_arrayvalue::format"]
        [::std::mem::offset_of!(t_vpi_arrayvalue, format) - 0usize];
    ["Offset of field: t_vpi_arrayvalue::flags"]
        [::std::mem::offset_of!(t_vpi_arrayvalue, flags) - 4usize];
    ["Offset of field: t_vpi_arrayvalue::value"]
        [::std::mem::offset_of!(t_vpi_arrayvalue, value) - 8usize];
};
pub type p_vpi_arrayvalue = *mut t_vpi_arrayvalue;
#[doc = " system task/function structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct t_vpi_systf_data {
    pub type_: PLI_INT32,
    pub sysfunctype: PLI_INT32,
    pub tfname: *mut PLI_BYTE8,
    pub calltf: ::std::option::Option<unsafe extern "C" fn(arg1: *mut PLI_BYTE8) -> PLI_INT32>,
    pub compiletf: ::std::option::Option<unsafe extern "C" fn(arg1: *mut PLI_BYTE8) -> PLI_INT32>,
    pub sizetf: ::std::option::Option<unsafe extern "C" fn(arg1: *mut PLI_BYTE8) -> PLI_INT32>,
    pub user_data: *mut PLI_BYTE8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_vpi_systf_data"][::std::mem::size_of::<t_vpi_systf_data>() - 48usize];
    ["Alignment of t_vpi_systf_data"][::std::mem::align_of::<t_vpi_systf_data>() - 8usize];
    ["Offset of field: t_vpi_systf_data::type_"]
        [::std::mem::offset_of!(t_vpi_systf_data, type_) - 0usize];
    ["Offset of field: t_vpi_systf_data::sysfunctype"]
        [::std::mem::offset_of!(t_vpi_systf_data, sysfunctype) - 4usize];
    ["Offset of field: t_vpi_systf_data::tfname"]
        [::std::mem::offset_of!(t_vpi_systf_data, tfname) - 8usize];
    ["Offset of field: t_vpi_systf_data::calltf"]
        [::std::mem::offset_of!(t_vpi_systf_data, calltf) - 16usize];
    ["Offset of field: t_vpi_systf_data::compiletf"]
        [::std::mem::offset_of!(t_vpi_systf_data, compiletf) - 24usize];
    ["Offset of field: t_vpi_systf_data::sizetf"]
        [::std::mem::offset_of!(t_vpi_systf_data, sizetf) - 32usize];
    ["Offset of field: t_vpi_systf_data::user_data"]
        [::std::mem::offset_of!(t_vpi_systf_data, user_data) - 40usize];
};
#[doc = " system task/function structure"]
pub type p_vpi_systf_data = *mut t_vpi_systf_data;
#[doc = " SystemVerilog execution information structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct t_vpi_vlog_info {
    pub argc: PLI_INT32,
    pub argv: *mut *mut PLI_BYTE8,
    pub product: *mut PLI_BYTE8,
    pub version: *mut PLI_BYTE8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_vpi_vlog_info"][::std::mem::size_of::<t_vpi_vlog_info>() - 32usize];
    ["Alignment of t_vpi_vlog_info"][::std::mem::align_of::<t_vpi_vlog_info>() - 8usize];
    ["Offset of field: t_vpi_vlog_info::argc"]
        [::std::mem::offset_of!(t_vpi_vlog_info, argc) - 0usize];
    ["Offset of field: t_vpi_vlog_info::argv"]
        [::std::mem::offset_of!(t_vpi_vlog_info, argv) - 8usize];
    ["Offset of field: t_vpi_vlog_info::product"]
        [::std::mem::offset_of!(t_vpi_vlog_info, product) - 16usize];
    ["Offset of field: t_vpi_vlog_info::version"]
        [::std::mem::offset_of!(t_vpi_vlog_info, version) - 24usize];
};
#[doc = " SystemVerilog execution information structure"]
pub type p_vpi_vlog_info = *mut t_vpi_vlog_info;
#[doc = " PLI error information structure"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct t_vpi_error_info {
    pub state: PLI_INT32,
    pub level: PLI_INT32,
    pub message: *mut PLI_BYTE8,
    pub product: *mut PLI_BYTE8,
    pub code: *mut PLI_BYTE8,
    pub file: *mut PLI_BYTE8,
    pub line: PLI_INT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_vpi_error_info"][::std::mem::size_of::<t_vpi_error_info>() - 48usize];
    ["Alignment of t_vpi_error_info"][::std::mem::align_of::<t_vpi_error_info>() - 8usize];
    ["Offset of field: t_vpi_error_info::state"]
        [::std::mem::offset_of!(t_vpi_error_info, state) - 0usize];
    ["Offset of field: t_vpi_error_info::level"]
        [::std::mem::offset_of!(t_vpi_error_info, level) - 4usize];
    ["Offset of field: t_vpi_error_info::message"]
        [::std::mem::offset_of!(t_vpi_error_info, message) - 8usize];
    ["Offset of field: t_vpi_error_info::product"]
        [::std::mem::offset_of!(t_vpi_error_info, product) - 16usize];
    ["Offset of field: t_vpi_error_info::code"]
        [::std::mem::offset_of!(t_vpi_error_info, code) - 24usize];
    ["Offset of field: t_vpi_error_info::file"]
        [::std::mem::offset_of!(t_vpi_error_info, file) - 32usize];
    ["Offset of field: t_vpi_error_info::line"]
        [::std::mem::offset_of!(t_vpi_error_info, line) - 40usize];
};
#[doc = " PLI error information structure"]
pub type p_vpi_error_info = *mut t_vpi_error_info;
#[doc = " callback structures"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct t_cb_data {
    pub reason: PLI_INT32,
    pub cb_rtn: ::std::option::Option<unsafe extern "C" fn(arg1: *mut t_cb_data) -> PLI_INT32>,
    pub obj: vpiHandle,
    pub time: p_vpi_time,
    pub value: p_vpi_value,
    pub index: PLI_INT32,
    pub user_data: *mut PLI_BYTE8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_cb_data"][::std::mem::size_of::<t_cb_data>() - 56usize];
    ["Alignment of t_cb_data"][::std::mem::align_of::<t_cb_data>() - 8usize];
    ["Offset of field: t_cb_data::reason"][::std::mem::offset_of!(t_cb_data, reason) - 0usize];
    ["Offset of field: t_cb_data::cb_rtn"][::std::mem::offset_of!(t_cb_data, cb_rtn) - 8usize];
    ["Offset of field: t_cb_data::obj"][::std::mem::offset_of!(t_cb_data, obj) - 16usize];
    ["Offset of field: t_cb_data::time"][::std::mem::offset_of!(t_cb_data, time) - 24usize];
    ["Offset of field: t_cb_data::value"][::std::mem::offset_of!(t_cb_data, value) - 32usize];
    ["Offset of field: t_cb_data::index"][::std::mem::offset_of!(t_cb_data, index) - 40usize];
    ["Offset of field: t_cb_data::user_data"]
        [::std::mem::offset_of!(t_cb_data, user_data) - 48usize];
};
#[doc = " callback structures"]
pub type p_cb_data = *mut t_cb_data;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct t_vpi_assertion_step_info {
    pub matched_expression_count: PLI_INT32,
    pub matched_exprs: *mut vpiHandle,
    pub stateFrom: PLI_INT32,
    pub stateTo: PLI_INT32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_vpi_assertion_step_info"]
        [::std::mem::size_of::<t_vpi_assertion_step_info>() - 24usize];
    ["Alignment of t_vpi_assertion_step_info"]
        [::std::mem::align_of::<t_vpi_assertion_step_info>() - 8usize];
    ["Offset of field: t_vpi_assertion_step_info::matched_expression_count"]
        [::std::mem::offset_of!(t_vpi_assertion_step_info, matched_expression_count) - 0usize];
    ["Offset of field: t_vpi_assertion_step_info::matched_exprs"]
        [::std::mem::offset_of!(t_vpi_assertion_step_info, matched_exprs) - 8usize];
    ["Offset of field: t_vpi_assertion_step_info::stateFrom"]
        [::std::mem::offset_of!(t_vpi_assertion_step_info, stateFrom) - 16usize];
    ["Offset of field: t_vpi_assertion_step_info::stateTo"]
        [::std::mem::offset_of!(t_vpi_assertion_step_info, stateTo) - 20usize];
};
pub type p_vpi_assertion_step_info = *mut t_vpi_assertion_step_info;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct t_vpi_attempt_info {
    pub detail: t_vpi_attempt_info__bindgen_ty_1,
    pub attemptStartTime: s_vpi_time,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union t_vpi_attempt_info__bindgen_ty_1 {
    pub failExpr: vpiHandle,
    pub step: p_vpi_assertion_step_info,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_vpi_attempt_info__bindgen_ty_1"]
        [::std::mem::size_of::<t_vpi_attempt_info__bindgen_ty_1>() - 8usize];
    ["Alignment of t_vpi_attempt_info__bindgen_ty_1"]
        [::std::mem::align_of::<t_vpi_attempt_info__bindgen_ty_1>() - 8usize];
    ["Offset of field: t_vpi_attempt_info__bindgen_ty_1::failExpr"]
        [::std::mem::offset_of!(t_vpi_attempt_info__bindgen_ty_1, failExpr) - 0usize];
    ["Offset of field: t_vpi_attempt_info__bindgen_ty_1::step"]
        [::std::mem::offset_of!(t_vpi_attempt_info__bindgen_ty_1, step) - 0usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of t_vpi_attempt_info"][::std::mem::size_of::<t_vpi_attempt_info>() - 32usize];
    ["Alignment of t_vpi_attempt_info"][::std::mem::align_of::<t_vpi_attempt_info>() - 8usize];
    ["Offset of field: t_vpi_attempt_info::detail"]
        [::std::mem::offset_of!(t_vpi_attempt_info, detail) - 0usize];
    ["Offset of field: t_vpi_attempt_info::attemptStartTime"]
        [::std::mem::offset_of!(t_vpi_attempt_info, attemptStartTime) - 8usize];
};
pub type p_vpi_attempt_info = *mut t_vpi_attempt_info;
pub type vpi_assertion_callback_func = ::std::option::Option<
    unsafe extern "C" fn(
        reason: PLI_INT32,
        cb_time: p_vpi_time,
        assertion: vpiHandle,
        info: p_vpi_attempt_info,
        user_data: *mut PLI_BYTE8,
    ) -> PLI_INT32,
>;
pub type __builtin_va_list = [__va_list_tag; 1usize];
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __va_list_tag {
    pub gp_offset: ::std::os::raw::c_uint,
    pub fp_offset: ::std::os::raw::c_uint,
    pub overflow_arg_area: *mut ::std::os::raw::c_void,
    pub reg_save_area: *mut ::std::os::raw::c_void,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __va_list_tag"][::std::mem::size_of::<__va_list_tag>() - 24usize];
    ["Alignment of __va_list_tag"][::std::mem::align_of::<__va_list_tag>() - 8usize];
    ["Offset of field: __va_list_tag::gp_offset"]
        [::std::mem::offset_of!(__va_list_tag, gp_offset) - 0usize];
    ["Offset of field: __va_list_tag::fp_offset"]
        [::std::mem::offset_of!(__va_list_tag, fp_offset) - 4usize];
    ["Offset of field: __va_list_tag::overflow_arg_area"]
        [::std::mem::offset_of!(__va_list_tag, overflow_arg_area) - 8usize];
    ["Offset of field: __va_list_tag::reg_save_area"]
        [::std::mem::offset_of!(__va_list_tag, reg_save_area) - 16usize];
};
unsafe extern "C" {
    pub fn vpi_register_cb(cb_data_p: p_cb_data) -> vpiHandle;
    pub fn vpi_remove_cb(cb_obj: vpiHandle) -> PLI_INT32;
    pub fn vpi_get_cb_info(object: vpiHandle, cb_data_p: p_cb_data);
    pub fn vpi_register_systf(systf_data_p: p_vpi_systf_data) -> vpiHandle;
    pub fn vpi_get_systf_info(object: vpiHandle, systf_data_p: p_vpi_systf_data);
    pub fn vpi_handle_by_name(name: *mut PLI_BYTE8, scope: vpiHandle) -> vpiHandle;
    pub fn vpi_handle_by_index(object: vpiHandle, indx: PLI_INT32) -> vpiHandle;
    pub fn vpi_handle(type_: PLI_INT32, refHandle: vpiHandle) -> vpiHandle;
    pub fn vpi_handle_multi(
        type_: PLI_INT32,
        refHandle1: vpiHandle,
        refHandle2: vpiHandle,
        ...
    ) -> vpiHandle;
    pub fn vpi_iterate(type_: PLI_INT32, refHandle: vpiHandle) -> vpiHandle;
